tests/XML/LoginRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:auth="http://xml.kamsoft.pl/ws/kaas/login_types">
  <soapenv:Header/>
  <soapenv:Body>
    <auth:login>
      <auth:credentials>
        <auth:item>
          <auth:name>domain</auth:name>
          <auth:value>
            <auth:stringValue>01</auth:stringValue>
          </auth:value>
        </auth:item>
        <auth:item>
          <auth:name>login</auth:name>
          <auth:value>
            <auth:stringValue>TEST1</auth:stringValue>
          </auth:value>
        </auth:item>
        <auth:item>
          <auth:name>type</auth:name>
          <auth:value>
            <auth:stringValue>SWD</auth:stringValue>
          </auth:value>
        </auth:item>
        <auth:item>
          <auth:name>idntSwd</auth:name>
          <auth:value>
            <auth:stringValue>12345</auth:stringValue>
          </auth:value>
        </auth:item>
      </auth:credentials>
      <auth:password>qwerty!@#</auth:password>
    </auth:login>
  </soapenv:Body>
</soapenv:Envelope>