tests/XML/ChangePasswordRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://xml.kamsoft.pl/ws/common" xmlns:auth="http://xml.kamsoft.pl/ws/kaas/login_types">
  <soapenv:Header>
    <com:session id="12345678"/>
    <com:authToken id="qwertyuiop"/>
  </soapenv:Header>
  <soapenv:Body>
    <auth:changePassword>
      <auth:credentials>
        <auth:item>
          <auth:name>domain</auth:name>
          <auth:value>
            <auth:stringValue>01</auth:stringValue>
          </auth:value>
        </auth:item>
        <auth:item>
          <auth:name>login</auth:name>
          <auth:value>
            <auth:stringValue>TEST1</auth:stringValue>
          </auth:value>
        </auth:item>
        <auth:item>
          <auth:name>type</auth:name>
          <auth:value>
            <auth:stringValue>SWD</auth:stringValue>
          </auth:value>
        </auth:item>
        <auth:item>
          <auth:name>idntSwd</auth:name>
          <auth:value>
            <auth:stringValue>12345</auth:stringValue>
          </auth:value>
        </auth:item>
      </auth:credentials>
      <auth:oldPassword>qwerty!@#</auth:oldPassword>
      <auth:newPassword>asdfgh!@#</auth:newPassword>
      <auth:newPasswordRepeat>asdfgh!@#</auth:newPasswordRepeat>
    </auth:changePassword>
  </soapenv:Body>
</soapenv:Envelope>