tests/Functional/Request/Factory/__data__/change_password_request.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:auth="http://xml.kamsoft.pl/ws/kaas/login_types" xmlns:com="http://xml.kamsoft.pl/ws/common">
 <soapenv:Header>
  <com:session id="sessionId"/>
  <com:authToken id="token"/>
 </soapenv:Header>
 <soapenv:Body>
  <auth:login>
   <auth:credentials>
    <auth:item>
     <auth:name>login</auth:name>
     <auth:value>login</auth:value>
    </auth:item>
    <auth:item>
     <auth:name>domain</auth:name>
     <auth:value>15</auth:value>
    </auth:item>
    <auth:item>
     <auth:name>type</auth:name>
     <auth:value>LEK</auth:value>
    </auth:item>
    <auth:item>
     <auth:name>idntLek</auth:name>
     <auth:value>123</auth:value>
    </auth:item>
   </auth:credentials>
   <auth:newPassword>newPassword</auth:newPassword>
   <auth:newPasswordRepeat>newPassword</auth:newPasswordRepeat>
  </auth:login>
 </soapenv:Body>
</soapenv:Envelope>
